In [1]:
# Now let us check the accuracy of the model
# First we will import the required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import copy
# import seaborn as sns

Load output of the model

In [3]:
grand_truth = pd.read_csv('/Users/liujiaen/Documents/Text_Recognition/final_project/correct.csv',index_col=0)
grand_truth.head()

,correct,date,naive_date_confidence,total,naive_total_confidence,text
id,,,,,,
4,True,2017-02-27 12:29:14,0.687667,6.74,0.667967,CRF-CITY LA ROCHELLE\n33 RUE DE LA SCIERIE\n17...
5,True,2017-02-26 11:10:32,0.689433,11.16,0.667933,city\nCRF-CITY LA ROCHELLE\n33 RUE DE LA SCIER...
6,True,2017-02-25 11:05:35,0.704167,6.99,0.668133,CRF-CITY LA ROCHELLE\n33 RUE DE LA SCIERIE\n17...
9,True,2016-05-23 12:29:03,0.697633,5.04,0.668100,CRF-CITY LA ROCHELLE\n33 RUE DE LA SCIERIE\n17...
10,True,2016-04-22 20:25:13,0.685633,14.46,0.667833,Carrefour\ncity\nCRF-CITY LA ROCHELLE\n33 RUE ...

In [4]:
grand_truth_total = grand_truth['total']
grand_truth_total

id
4       6.74
5      11.16
6       6.99
9       5.04
10     14.46
       ...
912     1.66
913     7.30
923    63.56
935     8.60
936     5.98
Name: total, Length: 413, dtype: float64

In [5]:
regex_df = pd.read_csv('regex.csv', index_col=0, sep=';')
regex_df.sort_index(inplace=True)
regex_df.head()

                   date  amount
id
4   2017-02-27 12:24:45    0.3
5   2020-02-26 01:05:00  11.16
6                  None   1.44
9   2016-05-23 12:29:03   5.04
10  2016-04-22 00:00:00   4.46

In [6]:
regex_amount = regex_df['amount']
regex_amount

id
4         0.3
5       11.16
6        1.44
9        5.04
10       4.46
         ...
1902     0.95
1919     3.89
1929      3.7
1934     0.72
1964     0.65
Name: amount, Length: 500, dtype: object

In [7]:
regex_amount = regex_amount[regex_amount.index.isin(grand_truth_total.index)]

In [8]:
regex_amount

id
4         0.3
5       11.16
6        1.44
9        5.04
10       4.46
         ...
1795      8.5
1815     45.9
1856      3.0
1869      2.1
1964     0.65
Name: amount, Length: 413, dtype: object

In [12]:
grand_truth_total[4]

6.74

In [19]:
correct = 0
for i in grand_truth_total.index:
    if regex_amount[i] == 'None ':
        continue
    if float(grand_truth_total[i]) == float(regex_amount[i]):
        print(i, grand_truth_total[i], regex_amount[i])
        correct += 1

5 11.16 11.16
9 5.04 5.04
15 12.07 12.07
30 4.11 4.11
34 6.71 6.71
48 19.26 19.26
55 5.3 5.3
65 6.7 6.7
86 1.95 1.95
89 2.14 2.14
96 2.52 2.52
98 2.3 2.3
104 13.71 13.71
109 2.61 2.61
113 5.4 5.4
129 4.86 4.86
132 6.88 6.88
138 4.23 4.23
142 13.77 13.77
148 5.28 5.28
152 5.16 5.16
153 6.22 6.22
154 6.15 6.15
162 8.9 8.9
181 13.01 13.01
184 5.78 5.78
185 7.91 7.91
188 10.98 10.98
189 4.63 4.63
191 59.42 59.42
194 36.73 36.73
197 21.49 21.49
204 25.68 25.68
210 86.29 86.29
219 17.12 17.12
222 14.48 14.48
224 11.73 11.73
228 58.47 58.47
233 18.96 18.96
235 10.2 10.2
247 3.85 3.85
250 18.71 18.71
267 4.4 4.4
271 8.61 8.61
275 8.02 8.02
276 6.9 6.9
278 6.44 6.44
279 8.34 8.34
280 6.56 6.56
281 6.24 6.24
284 8.2 8.2
285 8.82 8.82
287 5.42 5.42
288 7.9 7.9
289 9.11 9.11
293 52.31 52.31
295 5.15 5.15
307 4.23 4.23
309 6.06 6.06
314 6.92 6.92
336 4.39 4.39
341 14.76 14.76
345 5.98 5.98
347 3.21 3.21
359 5.16 5.16
363 10.44 10.44
365 4.62 4.62
372 8.0 8.0
375 4.3 4.3
384 1.68 1.68
391 11.71 11.71
395 6.81 6.81
398 6.86 6.86
399 14.76 14.76
402 1.71 1.71
413 9.74 9.74
417 3.39 3.39
421 7.9 7.9
423 10.83 10.83
433 21.35 21.35
446 4.23 4.23
456 5.73 5.73
459 1.4 1.4
462 6.15 6.15
475 18.59 18.59
481 28.16 28.16
489 53.38 53.38
491 6.26 6.26
492 23.93 23.93
495 10.0 10.0
504 8.37 8.37
506 13.7 13.7
511 38.16 38.16
513 30.68 30.68
516 41.36 41.36
524 6.42 6.42
525 7.48 7.48
531 4.28 4.28
532 16.47 16.47
542 6.11 6.11
543 7.32 7.32
545 6.7 6.7
548 1.08 1.08
549 6.51 6.51
550 9.67 9.67
554 6.77 6.77
559 5.8 5.8
562 2.14 2.14
564 1.78 1.78
569 0.5 0.5
570 13.82 13.82
571 13.3 13.3
574 9.36 9.36
587 11.27 11.27
588 0.65 0.65
591 90.94 90.94
603 6.92 6.92
617 4.35 4.35
619 7.25 7.25
622 8.07 8.07
652 5.26 5.26
666 23.23 23.23
678 9.4 9.4
685 7.3 7.3
690 8.0 8.0
719 87.4 87.4
738 5.47 5.47
794 59.3 59.3
802 6.0 6.0
809 9.5 9.5
824 4.0 4.0
841 9.1 9.1
854 4.21 4.21
897 1.16 1.16
934 1.5 1.5
937 1.75 1.75
966 7.0 7.0
970 8.25 8.25
977 19.0 19.0
982 11.1 11.1
1122 66.4 66.4
1249 1.5 1.5
1256 8.5 8.5
1317 20.06 20.06
1442 9.9 9.9
1530 5.0 5.0
1539 3.1 3.1
1540 22.0 22.0
1567 54.9 54.9
1697 9.99 9.99
1720 4.89 4.89
1728 4.82 4.82
357 11.81 11.81
566 19.07 19.07
596 3.9 3.9
598 1.56 1.56
630 46.0 46.0
637 0.96 0.96
654 83.0 83.0
681 19.0 19.0
683 91.9 91.9
695 5.67 5.67
726 9.11 9.11
735 90.0 90.0
758 5.44 5.44
771 58.5 58.5
782 49.66 49.66
790 19.4 19.4
815 84.6 84.6
905 14.31 14.31
911 7.35 7.35
912 1.66 1.66
913 7.3 7.3
935 8.6 8.6

In [21]:
correct/len(grand_truth_total)

0.4213075060532688

In [18]:
grand_truth_total.index

RangeIndex(start=0, stop=413, step=1)

In [17]:
regex_amount.index

Int64Index([  4,   5,   6,   9,  10,  15,  16,  17,  19,  23,
            ...
            391, 393, 394, 395, 397, 398, 399, 402, 405, 409],
           dtype='int64', name='id', length=159)

In [23]:
lm_df = pd.read_csv('output.csv', sep=";", index_col=0)
lm_df.head()

            text  label
id
362        7,82€  TOTAL
362   07/06/2017   DATE
23         1.62€  TOTAL
23      09/06/20   DATE
1543          4,  TOTAL

In [26]:
lm_df.sort_index(inplace=True)
lm_df.head()

          text  label
id
4   27/02/2017   DATE
4       6b.74€  TOTAL
5       11.16€  TOTAL
5     26/02/20   DATE
6        b.99€  TOTAL

In [17]:
date = copy.deepcopy(lm_df[lm_df['label'] == 'DATE'])
date.head()

     id        text label
1   362  07/06/2017  DATE
3    23    09/06/20  DATE
5  1543          DI  DATE
6  1543         203  DATE
7  1543         13:  DATE

In [18]:
total = copy.deepcopy(lm_df[lm_df['label'] == 'TOTAL'])
total
total.head()

      id   text  label
0    362  7,82€  TOTAL
2     23  1.62€  TOTAL
4   1543     4,  TOTAL
10  1934   7.90  TOTAL
11  1934   7.90  TOTAL

In [20]:
total["id"] = total["id"].astype(int)

In [22]:
total["id"]

0       362
2        23
4      1543
10     1934
11     1934
       ...
822    1096
825     222
826     222
830    1731
831     204
Name: id, Length: 358, dtype: int64